ansible/playbooks/results/pgbench_local_path/pgbench_read_only_result_cnpg.txt
pgbench (18.3 (Ubuntu 18.3-1.pgdg24.04+1), server 18.1 (Debian 18.1-1.pgdg13+2))
transaction type: <builtin: select only>
scaling factor: 3000
query mode: simple
number of clients: 295
number of threads: 8
maximum number of tries: 1
duration: 900 s
number of transactions actually processed: 34142754
number of failed transactions: 0 (0.000%)
latency average = 7.771 ms
initial connection time = 1069.476 ms
tps = 37963.010676 (without initial connection time)