ansible/playbooks/results/pgbench_local_path/pgbench_read_only_result_pg.txt
pgbench (18.3 (Ubuntu 18.3-1.pgdg24.04+1))
transaction type: <builtin: select only>
scaling factor: 3000
query mode: simple
number of clients: 295
number of threads: 8
maximum number of tries: 1
duration: 900 s
number of transactions actually processed: 36712799
number of failed transactions: 0 (0.000%)
latency average = 7.227 ms
initial connection time = 1092.818 ms
tps = 40819.319622 (without initial connection time)